Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: དེ་ན་གྲོང་དང་། ཚོང་དུས་དང་། རི་ཁྲོད་སྟོང་ཕྲག་མང་པོ་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་གནས་པ་ཡོད་དེ།
en: There were many thousands of villages, hamlets, and market towns, as well as many hundreds of thousands of millions and billions of beings.

source: ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན། ནད་ཆེན་པོའི་བསྐལ་པ་བར་མ་བྱུང་སྟེ།
en: At that moment and time, Śāntamati, there occurred a lengthy period of great pestilence.

source: དེར་སེམས་ཅན་དག་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པར་གྱུར་ནས་ཕལ་ཆེར་ལུས་ཤུ་བ་ཅན་དང་། ལུས་རྣགས་པ་དང་། འབྲས་དང་། ཕོལ་མིག་དང་། མེ་དབལ་དང་།
en: Most beings there were afflicted as various diseases spread: diseases of the body’s air, heat, and phlegm, resulting in symptoms like pus-filled boils, lesions, scabs, rashes, and blisters.

source: ཐོར་བུ་དང་། རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་གྱི་ནད་རྣམས་ཀྱིས་རྒྱས་པར་གྱུར་ཏོ། །དེའི་ཚེ་སྨན་པ་སྟོང་ཕྲག་དུ་མ་སེམས་ཅན་དེ་དག་གི་ནད་དེ་ཞི་བར་བྱ་བའི་ཕྱིར་བརྩོན་པར་གྱུར་ཀྱང་སེམས་ཅན་དེ་དག་གི་ནད་དེ་བསལ་བར་མ་ནུས་སོ། །
en: Many thousands of doctors labored to relieve the symptoms of these beings, but they were unable to cure them of the disease.

source: དེར་སེམས་ཅན་དེ་དག་གིས་གསོ་བའི་དཔྱད་མ་རྙེད་དེ།
en: As no cure could be found for these beings, and they were without any protection or refuge, they gave a great cry:

source: སྐྱབས་མེད་རྟེན་མེད་ནས་འདི་སྐད་དུ།
en: “ ‘Oh, we will give away all our wealth

source: ནད་འདི་ལས་ནི་ཐར་བྱེད་པ། །
en: To whoever can free us from this illness!

source: ལྷ་འམ་ཀླུ་འམ་དྲི་ཟ་འམ། །
en: It doesn’t matter if he is a god, Nāga, gandharva, yakṣa,

source: གནོད་སྦྱིན་དང་ནི་མི་ཡང་རུང་། །
en: “ ‘Human, or nonhuman.

source: མི་མ་ཡིན་པ་སུ་ཞིག་ཡོད། །
en: We will follow the instructions

source: སྡུག་བསྔལ་འདི་ལས་ཐར་བྱེད་པ། །དེ་ལ་ནོར་རྣམས་ཐམས་ཅད་གཏང་། །རྗེས་སུ་བསྟན་པ་བཞིན་དུ་བྱ། །
en: Of whoever can free us from this suffering.

source: བྱས་པ་དག་ཀྱང་གཟོ་བར་བྱ། །
en: We will feel gratitude toward him!’

source: ཞེས་ཀུ་ཆོ་ཆེར་བཏོན་ཏོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འདི་དེའི་ཚེ་དེའི་དུས་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མིག་བཟངས་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: “At that time, Śāntamati, the blessed Śākyamuni was a śakra, a lord of the gods, named Sunetra.

source: དེས་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་སེམས་ཅན་དེ་དག་ནད་སྣ་ཚོགས་མང་པོས་བཏབ་པ་ཡང་མཐོང་།
en: With his pure divine eyesight surpassing that of ordinary human beings, he could see that these beings were afflicted with various diseases.

source: ལྷའི་རྣ་བ་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་ཀུ་ཆོ་ཆེན་པོ་འདོན་པའི་སྒྲ་ཡང་ཐོས་སོ། །
en: With his pure divine hearing surpassing that of ordinary human beings, he heard the sound of their great cries.

source: དེས་དེ་དག་མཐོང་ཞིང་ཐོས་ནས་ཀྱང་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་དེ།
en: When he saw and heard them, he developed tremendous compassion.

source: དེ་འདི་སྙམ་དུ་བདག་ཅི་ནས་སེམས་ཅན་གནས་མེད་པ་འདི་དག་གི་གནས་སུ་འགྱུར་བར་བྱའོ། །
en: He thought, ‘I must help these helpless beings.

source: སྐྱབས་མེད་པ་དང་། རྟེན་མེད་པ་རྣམས་ཀྱི་སྐྱབས་དང་རྟེན་དུ་འགྱུར་བར་བྱའོ་སྙམ་དུ་བསམས་ནས་དེས་དེ་མ་ཐག་ཏུ་འཛམ་བུའི་གླིང་གི་དབུས་ན་གྲོང་ཁྱེར་ཆེན་པོ་ཀུ་རུ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དང་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ཏུ་སྲོག་ཆགས་དེས་པ་ཞེས་བྱ་བར་རྫུས་ཏེ་སྐྱེས་ནས་སྟེང་གི་བར་སྣང་ལ་འདུག་སྟེ་འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ལ་ཚིགས་སུ་བཅད་པས་བསྐུལ་པ།
en: I must protect and support these weak and defenseless beings.’ Right then and there in the center of Jambudvīpa, not far from the great city of Kuru, he spontaneously appeared as a creature by the name of Saumya, and the following verses offering encouragement to all the people of Jambudvīpa came from the sky:

source: ཀུ་རུའི་གྲོང་ཁྱེར་ཉེ་བ་ན། །
en: “ ‘Near to the city of Kuru

source: སྲོག་ཆགས་དེས་བ་ཞེས་བྱ་ཡོད། །
en: There is a creature named Saumya.

source: དེ་ཡི་ཤལ་སུས་ཟོས་པ། །
en: Whoever consumes its flesh

source: དེ་ནི་ནད་ལས་ཐར་བར་འགྱུར། །
en: Will be freed from their disease.

source: འཇིགས་པར་མ་བྱེད་སྐྲག་པར་མ་བྱེད་པར། །ཇི་ལྟར་འདོད་པ་དེའི་ཤ་ལོང་ཤིག །
en: “ ‘Take as much of its flesh as you wish Without fear or fright.

source: དེ་ལ་ཁྲོ་མེད་གཤེ་མེད་གནོད་སེམས་མེད། །
en: It will have no anger, complaint, or malice.

source: འཛམ་བུའི་གླིང་འདིར་དེ་ནི་སྨན་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་གྲོང་དང་།
en: This is medicine for Jambudvīpa.’

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཚོང་དུས་དང་། རི་ཁྲོད་དེ་དག་ན་སེམས་ཅན་ནད་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་གིས་སྒྲ་དེ་ཐོས་ནས་གྲོང་ཁྱེར་ཆེན་པོ་ཀུ་རུ་ག་ལ་བ་དང་། སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་སྲོག་ཆགས་དེས་པའི་ལུས་ལས་ཤ་བཅད་ཅིང་བཅད་ཅིང་ཁྱེར་ཡང་དེའི་ལུས་ལ་ཤ་ཟད་པར་མ་གྱུར་ནས་དེས་པས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: “Thereupon, Śāntamati, when all the sick people of the cities, towns, villages, hamlets, and market towns heard this, they went to the great city of Kuru to the place where they found the creature Saumya, and even though they cut flesh from its body again and again, and carried it away, still the flesh of its body did not become depleted.

source: བདེན་པ་གང་གིས་བྱང་ཆུབ་ཐོབ་འགྱུར་ཞིང་། །
en: Saumya then spoke this verse: “ ‘If it is true that I will achieve awakening,

source: བདག་གི་ཡེ་ཤེས་ཟད་པར་མི་འགྱུར་བ། །
en: And my knowledge will be inexhaustible,

source: བདེན་པ་དེས་ནི་བདག་གི་ལུས་ལས་ཤ། །
en: Then, by this truth, may the flesh of my body

source: འདིར་ནི་ནམས་ཀྱང་ཟད་པར་མ་གྱུར་ཅིག །
en: Never be exhausted for all of you here!’

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་ཕྱོགས་བཞིའི་སེམས་ཅན་ནད་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་གིས་སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པའི་ལུས་ལས་ཤ་བཅད་ཅིང་བཅད་ཅིང་ཁྱེར་ཡང་། དེའི་ལུས་ལས་བྲི་བའམ།
en: “Thus, Śāntamati, the sick people throughout the four directions never witnessed the body of this creature, Saumya, become depleted or exhausted, despite the fact that they cut flesh from its body again and again, and carried it away.

source: གང་བར་ཡང་མི་མངོན་ཏེ་ཡང་བཅད་ཡང་བཅད་ཀྱང་ཕྱིར་སྐྱེ་བར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་སེམས་ཅན་ཇི་སྙེད་ཀྱིས་སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པའི་ཤ་ཟོས་པ་དེ་དག་ཟོས་མ་ཐག་ཏུ་ནད་ཐམས་ཅད་ཞི་བར་གྱུར་ཏེ།
en: Whatever they cut away simply grew back, and, Śāntamati, all persons who consumed the flesh from the creature Saumya found their symptoms alleviated immediately upon doing so.

source: ནད་མེད་ཅིང་བདེ་བ་དང་། ཉམས་པ་མེད་པར་གྱུར་ཏོ། །
en: They became well, happy, and healthy.

source: དེ་ནས་མཐར་གྱིས་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་གྱི་ནད་ཐམས་ཅད་བསལ་བར་གྱུར་ཏོ། །
en: Finally, all the diseases of the people of Jambudvīpa were eliminated.

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་འཛམ་བུའི་གླིང་གི་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དག་འདི་སྙམ་དུ་སེམས་ཏེ་སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པ་དེས་བདག་ཅག་ནད་ལས་ཡོངས་སུ་ཐར་ཅིང་ནད་མེད་པར་བྱས་ཏེ་བདེ་ཞིང་ཉམས་པ་མེད་པར་བྱས་ཀྱིས་བདག་ཅག་གིས་དེ་ལ་མཆོད་པའི་གནས་ཤིག་བྱའོ་སྙམ་ནས་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་འདུས་ཏེ་སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པ་ག་ལ་བ་དེར་སོང་ནས་ཐལ་མོ་སྦྱར་ཏེ་སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པ་ལ་ཚིགས་སུ་བཅད་པས་སྨྲས་པ།
en: “Śāntamati, the men, women, boys, and girls of Jambudvīpa then thought, ‘Since this creature, Saumya, well and truly freed us from illness and made us happy and healthy, we should worship it.’ They all gathered together and went to the place where they found the creature Saumya. They stretched out their arms, palms together in a gesture of salutation toward the creature Saumya, and spoke the following verse:

source: ཁྱོད་ནི་བདག་ཅག་གནས་དང་སྐྱབས། །
en: “ ‘You are our refuge and protection.

source: ཁྱོད་ནི་བདག་ཅག་སྨན་པ་སྨན། །
en: You are our doctor and medicine.

source: ཁྱོད་ལ་མཆོད་པ་གང་བགྱི་བ། །
en: We will worship you in whatever way we can.

source: ཁྱོད་ཀྱིས་བདག་ཅག་བཀའ་སྩོལ་ཅིག །
en: Please give us your teachings.’

source: དེ་ནས་སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པས་ལུས་དེ་མི་སྣང་བར་བྱས་ཏེ་བདག་གིས་བརྒྱ་བྱིན་གྱི་ལུས་སུ་འདུག་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་ལ་ཚིགས་སུ་བཅད་པས་སྨྲས་པ།
en: “At that moment the body of the creature disappeared and Śakra appeared in his own body. He then spoke these verses to the assembled people:

source: ང་ལ་ནོར་དང་ཟས་སྐོམ་དང་། །གསེར་དང་འབྲུ་རྣམས་དགོས་པ་མེད། །
en: “ ‘I have no need for wealth, food and drink, Gold, or grain.

source: ཐམས་ཅད་ལྷན་ཅིག་འཐུན་པར་ནི། །
en: Instead, all should come together harmoniously and

source: དགེ་བ་བཅུ་ཡི་ལས་ལམ་སྲུངས། །
en: Maintain the path of the ten forms of good conduct.

source: སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་སྨོན་ལམ་བརྟན་པ་ཐོབ། །
en: “ ‘Be firm in your aspiration to awaken For the benefit of all beings.

source: ཕན་པའི་དངོས་པོ་ཉིད་ཀྱི་སེམས། །
en: With a thought for what will be beneficial,

source: གཅིག་ལ་གཅིག་ཀྱང་བྱམས་པ་བསྐྱེད། །
en: Develop love for one another.’

source: བརྒྱ་བྱིན་ལས་ནི་ཚིག་འདི་ཐོས། །སེམས་ཅན་དེ་དག་རབ་དགའ་སྟེ། །
en: “When the beings heard this from Śakra, They were delighted,

source: ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ཡི། །
en: And they undertook the truly pure path

source: དགེ་བ་བཅུ་ཡི་ལས་ལམ་བླངས། །
en: Of the ten forms of good conduct.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་ཚུན་ཆད་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དེ་སྙེད་ལས་ཐ་ན། །སེམས་ཅན་གཅིག་ཀྱང་ལོག་པར་ལྟུང་བར་སོང་བ་མི་དྲན་ནོ། །
en: “From that point forward, Śāntamati, among all the men, women, boys, and girls of Jambudvīpa, not even a single person was reborn in the lower realms.

source: དེ་ཚུན་ཆད་དེ་དག་ཐམས་ཅད་ཤི་འཕོས་ཏེ་ཤི་བའི་དུས་བྱས་ནས་ཀྱང་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་ཏེ།
en: Thenceforth, when the time came for them to die and be reborn, each of them was reborn in the higher realms at the same level as the gods in the Heaven of the Thirty-Three.

source: དེ་དག་ཡང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དེས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་དགའ་བར་བྱས། ཡང་དག་པར་འཛིན་དུ་བཅུག །
en: They were delighted by the instruction in the Dharma given by Śakra, Lord of the Gods.

source: ཡང་དག་པར་གཟེངས་བསྟོད་ནས།
en: They took it completely to heart and felt truly encouraged by it.

source: དེ་ལ་ཁ་ཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Some of them conceived the aspiration for unsurpassable and perfect awakening.

source: ཁ་ཅིག་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ །
en: Some of them purified the spotless and immaculate Dharma eye in regard to things.

source: ཞི་བའི་བློ་གྲོས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གསང་བ་དང་། ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་སྟེ།
en: Śāntamati, this is the secret of the bodhisattvas’ body and the purity of their physical activity.

source: དེ་ལྟར་ལུས་གཅིག་ཡོངས་སུ་བཏང་བས་ན་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: In this way, by giving up a single body, they bring countless, limitless beings to maturity.”

source: གཞན་ཡང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ནི་མི་ཤིགས་པ།
en: Vajrapāṇi, Lord of the Guhyakas, then spoke further to the bodhisattva Śāntamati: “The body of a bodhisattva is unbreakable, Śāntamati;

source: སྲ་བ། བརྟན་པ། འཆི་འཕོ་མེད་པ། རྫུས་ཏེ་སྐྱེ་བ་སྟེ།
en: it is rock-solid, strong, not subject to change, and it arises spontaneously.

source: ལུས་དེ་ནི་འཇིག་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་འདུལ་བའི་དབང་གི་ཕྱིར་འཇིག་གོ །
en: This body disintegrates for the sake of guiding beings who need to be guided by its disintegration.

source: ལུས་མི་འཇིག་པས་འདུལ་བའི་སེམས་ཅན་རྣམས། འདུལ་བའི་དབང་གི་ཕྱིར་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མི་འཇིག་སྟེ།
en: This body stays whole for the sake of guiding beings who need to be guided by its wholeness.

source: མེས་མི་ཚིག །མཚོན་གྱིས་མི་ཚུགས་ཤིང་།
en: It cannot be burned by fire or pierced by weapons.

source: དངོས་རྡོ་རྗེ་ལྟར་སྲ་ཞིང་བརྟན་ཏེ། མི་ཤིགས་པའོ། །
en: It is rock-solid and strong like true vajra—it is unbreakable.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་ལུས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མི་སེམས་མི་རྟོག་སྟེ། ལུས་ལ་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “Śāntamati, though bodhisattvas bring beings to maturity in this way by means of the body, the bodhisattvas do not ponder or ruminate on this, for they know well that the body has the nature of being devoid of a defining characteristic.

source: ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱིས་ཀྱང་ཆོས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཤེས་སོ། །
en: Owing precisely to the body’s nature of being devoid of a defining characteristic, they know that things have the nature of being devoid of a defining characteristic.

source: ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དང་ཆོས་ཐམས་ཅད་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱང་གཉིས་སུ་མི་འབྱེད་དེ།
en: The body’s nature of being devoid of a defining characteristic and the nature of all things as being devoid of a defining characteristic cannot be separated into a duality.

source: ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱི་མཚན་ཉིད་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱི་མཚན་ཉིད་དོ། །
en: The fact that the essential defining characteristic of the body is precisely its being devoid of a defining characteristic is the essential defining characteristic of a thing’s being devoid of a defining characteristic.

source: དེ་ལྟར་ན་དབེན་པའི་མཚན་ཉིད་ཀྱི་རྗེས་སུ་འཇུག་གོ །
en: Thus, the bodhisattvas conform to the nature of things as being devoid of a defining characteristic.

source: དེ་རང་གི་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་མཉམ་པར་བྱེད་དོ། །དེ་རང་གི་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དང་།
en: They make their own body’s nature of being devoid of a defining characteristic equal to the nature of all beings’ bodies as being devoid of a defining characteristic.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དུ་ཤེས་སོ། །
en: They know that their own body’s nature of being devoid of a defining characteristic and the nature of all beings’ bodies as being devoid of a defining characteristic is the nature of the realm of reality as being devoid of a defining characteristic.

source: ཆོས་ཕྲ་རབ་ཙམ་ཡང་མི་དམིགས་པས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱང་རྗེས་སུ་འཐོབ་བོ། །
en: Because they do not comprehend even the smallest particle of a thing, they consequently attain the realization of the nature of the realm of reality as being devoid of a defining characteristic and also the nature of all things as being devoid of a defining characteristic.

source: དེ་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་སོ། །
en: “Owing to the way their own body is, they know the way the bodies of all beings are.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་སོ། །
en: Owing to the way the bodies of all beings are, they know the way their own body is.

source: དེ་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་སོ། །
en: Owing to the way their own body is, they know the way all things are.

source: ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་སོ། །
en: Owing to the way all things are, they know the way all buddhas are.

source: དེ་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་འདས་པ་དང་། །མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་ཤེས་ཏེ།
en: Owing to the way their own body is, they know the way the past, present, and future are.

source: འདས་པའི་དེ་བཞིན་ཉིད་ཀྱང་མ་འོངས་པའི་དེ་བཞིན་ཉིད་དང་འགལ་བར་མི་བྱེད་དོ། །
en: The way the past is does not contradict the way the future will be.

source: འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་དེ་བཞིན་ཉིད་དོ། །
en: The fact that the past, present, and future are the way they are is the way the aggregates, sense spheres, and elements are.

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་དེ་བཞིན་ཉིད་དོ། །
en: The fact that the aggregates, sense spheres, and elements are the way they are is itself the way defiled and purified things are.

source: ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་ཉིད་དོ། །
en: The fact that defiled and purified things are the way they are is itself the way saṃsāra and nirvāṇa are.

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་མངོན་པར་འདུ་མི་བྱེད་པའི་དེ་བཞིན་ཉིད་དོ། །
en: The fact that saṃsāra and nirvāṇa are the way they are is the way unconditioned things are.

source: མངོན་པར་འདུ་མི་བྱེད་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་མངོན་པར་འདུ་བྱེད་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་དེ་ཉིད་ཡིན་ནོ། །
en: The fact that unconditioned things are the way they are is itself the way all conditioned things are, and the fact that they are the way they are.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ནི་དེ་ཁོ་ན་ཉིད་དང་།
en: “Noble son, ‘the way things are’ is the nature of this;

source: དེ་ལྟ་བུ་ཉིད་དང་།
en: it is the nature of that;

source: གཞན་མ་ཡིན་པ་ཉིད་དང་།
en: it is the nature of not being different;

source: མི་འགྱུར་བ་ཉིད་དང་།
en: it is the nature of not changing;

source: མི་འབྱུང་བ་ཉིད་དང་།
en: it is the nature of not arising;

source: རྩོད་པ་མེད་པ་ཉིད་དང་།
en: it is the nature of not being in conflict;

source: གཟུགས་མེད་པ་ཉིད་དོ། །
en: it is the nature of being without a form.

source: དེ་བཞིན་ཉིད་ལ་གཟུགས་གང་ཡང་མེད་དེ། གཟུགས་མེད་པ་ནི་དེ་བཞིན་ཉིད་ཅེས་བྱའོ། །
en: The way things are has no form at all, and what has no form is called the way things are.

source: ཇི་ལྟར་དེ་བཞིན་ཉིད་གཟུགས་མེད་པ་དེ་བཞིན་དུ་གཟུགས་ཐམས་ཅད་ཀྱང་གཟུགས་མེད་པ་སྟེ།
en: Just as the way things are has no form, in the same way all forms have no form.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་གཟུགས་དེ་སྟོན་ཀྱང་དེ་བཞིན་ཉིད་གཟུགས་སུ་མི་བྱེད་དོ། །
en: Although bodhisattvas display their forms to all beings, they do not turn the way things are into a form.

source: དེ་གཟུགས་མེད་ཅིང་རྩོད་པ་མེད་ཀྱང་ལུས་དང་གཟུགས་ཐམས་ཅད་ཀྱང་སྟོན་ཏེ་དེ་བཞིན་ཉིད་ཀྱང་འཁྲུགས་པར་མི་བྱེད་དོ། །
en: Even though they are formless and beyond conflict and they display diverse bodies and forms, still they do not disturb the way things are.

source: དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་རྟོག་གོ །
en: “With knowledge of the way things are, one reflects on the body of a realized one.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་མཉམ་པ་ཉིད་ཀྱིས་བདག་གི་ལུས་མཉམ་པ་ཉིད་ལ་རྟོག་གོ །
en: Owing to its equality with the body of a realized one, one reflects on the equality of one’s own body.

source: ལུས་ནི་ཤིན་ཏུ་མ་སྐྱེས་པ་ཉིད་ཡིན་པས་ན་ལུས་ཐམས་ཅད་ནི་ལུས་མེད་པར་ཡང་དག་པར་མཐོང་ངོ་། །
en: Owing to the fact that the body is not born at all, one correctly perceives that nobody has a body.

source: ལུས་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་རབ་ཏུ་ཤེས་སོ། །
en: One knows that all bodies are dependently arisen.

source: ཤེས་ནས་ཆོས་ཀྱི་སྐུ་མངོན་པར་སྒྲུབ་བོ། །
en: Knowing this, one acquires the Dharma body.

source: དེ་ཆོས་ཀྱི་སྐུ་མངོན་པར་བསྒྲུབས་པས་ཆོས་ཀྱི་སྐུ་ཉིད་དུ་འགྱུར་ཏེ།
en: By acquiring the Dharma body, one becomes this very Dharma body.

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་ལུས་ནི་མ་ཡིན་ནོ། །
en: This is not the body of the aggregates, elements, and sense spheres.

source: དེ་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བས་ན་མཐོང་བས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །
en: When one manifests the Dharma body, then beings benefit just by seeing it.

source: ཐོས་པ་དང་། རེག་པས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །
en: Beings benefit just by hearing it or touching it.

source: ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “I will draw an analogy, Śāntamati.

source: སྨན་པའི་རྒྱལ་པོ་འཚོ་བྱེད་ཀྱིས་རྩི་ཐམས་ཅད་བསྡུས་ཏེ། རྩིའི་ཤིང་མང་པོ་ལས་བུ་མོའི་གཟུགས་བཟང་ཞིང་མཛེས་པ། བལྟ་ན་སྡུག་པ་ལེགས་པར་བྱས་ཏེ།
en: Consider how the healer, the king of physicians, collects all types of medicinal substances, and with these many medicinal substances he fashions the figure of a well-formed, beautiful, and elegant girl.

source: ལེགས་པར་ཟིན་ཅིང་ལེགས་པར་བྱི་དོར་བྱས་པ་དེ་འོང་བ་འམ། འགྲོ་བ་འམ། འགྲེང་ངམ། འདུག་གམ། ཉལ་ཡང་རྟོག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་དོ། །དེར་ནད་པ་གང་བཙུན་པ་འམ་རྒྱལ་པོའམ། རྒྱལ་པོའི་བློན་པོ་ཆེན་པོའམ།
en: Having properly enlivened and properly prepared this figure, the girl may come and go, stand, sit, and lie down, and yet she does not form ideas and she does not form conceptions.

source: རྒྱལ་པོའི་བུ་འམ། ཚོང་དཔོན་ནམ། ཁྱིམ་བདག་གམ། བློན་པོའམ། རྒྱལ་ཕྲན་གང་དག་འོང་བ་དེ་དག་སྨན་པའི་རྒྱལ་པོ་འཚོ་བྱེད་ཀྱིས་སྨན་གྱི་བུ་མོ་དེ་དང་ཕྲད་ནས་དེ་དག་ཕྲད་མ་ཐག་ཏུ་ནད་ཐམས་ཅད་བྱང་སྟེ།
en: Any sick monk, king, royal minister, prince, merchant, householder, government official, or regional ruler who comes and encounters this girl made from medicinal substances by the healer, the king of physicians, will then find themselves immediately cleansed of their maladies.

source: ནད་མེད་ཅིང་བདེ་ལ་ཉམས་པ་མེད་པར་འགྱུར་རོ། །
en: They will be made well and truly happy and healthy.

source: ཞི་བའི་བློ་གྲོས་གང་སྨན་པ་གཞན་ལ་མེད་པ་སྨན་པའི་རྒྱལ་པོ་འཚོ་བྱེད་ཀྱི་འཇིག་རྟེན་གྱི་ནད་གསོ་བའི་ཤེས་པ་ལ་ལྟོས། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བ་ཡང་སེམས་ཅན་བུད་མེད་དང་།
en: Śāntamati, no other physician can do that. Such is the knowledge of medicine possessed by the king of physicians with regard to the diseases of the world.

source: སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་ཡོངས་སུ་གདུངས་པ་ཇི་སྙེད་པ་དག་གིས་ལུས་ལ་རེག་ན་རེག་མ་ཐག་ཏུ་དེ་དག་གི་ཉོན་མོངས་པ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ། །
en: In the same way, Śāntamati, bodhisattvas manifest the Dharma body so that whenever any beings who are afflicted by attachment, aversion, and ignorance—whether woman, man, boy, or girl—make contact with the body of a bodhisattva, all of their afflictions will cease immediately.

source: ལུས་ཡོངས་སུ་གདུང་བ་དང་བྲལ་བར་ཡང་ཤེས་སོ། །
en: They will experience their bodies free from all misery.

source: དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཉིད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་ཤིན་ཏུ་དག་པའི་ཕྱིར་རོ། །
en: This is due to the complete purification of that bodhisattva’s previous vows.

source: ཞི་བའི་བློ་གྲོས་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བའི་ཕྱིར་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གསང་བའོ། །
en: Śāntamati, this cause of manifesting the Dharma body is also a secret of the body of bodhisattvas.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྐུ་དང་ལྡན་པ་རྣམས་ཀྱི་ལུས་ནི་ཟས་སྐོམ་གྱིས་བསྐྱེད་པ་མ་ཡིན།
en: “Śāntamati, the bodies of those bodhisattvas who possess the Dharma body do not grow by means of food and drink.

source: ཁམ་གྱིས་ཟ་བའི་ཟས་ཀྱིས་ཀྱང་ལུས་འཚོ་བ་མ་ཡིན་ཏེ།
en: Their bodies are not nourished even by consuming food with their mouths.

source: དེ་ཟས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པས་སེམས་ཅན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ཟས་ཟའོ། །
en: Because they possess an understanding of all foods, they eat food out of compassion for beings.

source: དེ་ཟས་ཟ་ཡང་མིད་པ་མ་ཡིན། ཟ་ཡང་ཁོང་དུ་འཇུག་པར་མི་བྱེད་དོ། །
en: Though they eat food, they do not swallow it, and it does not enter their bodies.

source: ཆོས་ཀྱི་སྐུའི་སྟོབས་ཀྱིས་མི་ཉམས་ཡོངས་སུ་མི་ཉམས་སོ། །
en: The power of the Dharma body ensures that their health does not decline or diminish in any way.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྐུ་དང་ལྡན་པ་ལ་སྐྱེ་བ་དང་། འཆི་འཕོ་དང་། འབྱུང་བ་མེད་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྐྱེ་བ་དང་།
en: “Śāntamati, though there is no birth, death, or rebirth for a bodhisattva who has the Dharma body, they display birth, death, and rebirth in order to bring beings to maturity.

source: འཆི་འཕོ་དང་། འབྱུང་བ་ཡང་སྟོན་ཏོ། །དེ་འཆི་འཕོ་ཡང་ཆོས་ཐམས་ཅད་ལ་འཆི་འཕོ་མེད་ཅིང་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་རབ་ཏུ་ཤེས་སོ། །
en: Though they die, they know that all things are unconditioned and nothing dies.

source: འབྱུང་ཡང་ཆོས་ཐམས་ཅད་ལ་འཕོ་བ་མེད་པར་རབ་ཏུ་ཤེས་སོ། །
en: Though they are reborn, they know that nothing is reborn.

source: སྐྱེ་ཡང་ཆོས་ཐམས་ཅད་ལ་སྐྱེ་བ་མེད་པར་རབ་ཏུ་ཤེས་སོ། །
en: Though they are born, they know that nothing is born.

source: དེ་ཆོས་ཀྱི་སྐུ་དང་ལྡན། ཆོས་ཀྱི་ཟས་དང་ལྡན། ཆོས་ཀྱི་སྟོབས་དང་ལྡན་ཞིང་ཆོས་ལ་རྟོན་པས་དེ་བཞིན་གཤེགས་པའི་སྐུ་རབ་ཏུ་ཤེས་ཏེ།
en: They possess the Dharma body, Dharma food, and Dharma power, and since they rely on the Dharma, they know the body of the realized ones.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ནམ་མཁའི་སྐུ། མི་མཉམ་པ་དང་མཉམ་པའི་སྐུ། འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ལས་བྱེ་བྲག་ཏུ་འཕགས་པའི་སྐུ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་ལྡན་པའི་སྐུ།
en: “Śāntamati, the body of a realized one is a body of space, a body that is equal to that which has no equal, a body that is the most distinguished in all the three worlds, a body in possession of the way all beings are.

source: དཔེ་མེད་པ།
en: It is incomparable.

source: འདྲ་བ་མེད་པ།
en: It is unique.

source: དག་པ།
en: It is pure.

source: དྲི་མ་མེད་པ།
en: It is immaculate.
